[
  {
    "headline": "Amperity Named a Leader in 2025 IDC MarketScape for Retail Customer Data Platforms",
    "summary": "The evaluation was based on several criteria including real-time personalization, generative AI and data activation, as well as company vision & strategy. Amperity, a AI-powered customer data cloud, announced that it has been positioned in the Leaders Category of the IDC MarketScape: Worldwide Retail Customer Data Platforms 2025 Vendor Assessment (doc #US52040225, June 2025). The […]",
    "date": "Fri, 04 Jul 2025 10:48:36 +0000",
    "link": "https://martechseries.com/predictive-ai/ai-platforms-machine-learning/amperity-named-a-leader-in-2025-idc-marketscape-for-retail-customer-data-platforms/",
    "source": "MarTech Series"
  },
  {
    "headline": "Optimizing AI and Automation in Marketing: Strategies to Prevent Budget Wastage and Maximize ROI",
    "summary": "Artificial intelligence (AI) and automation assume greater importance in modern marketing strategies. They are transforming traditional marketing approaches, offering deep insights, and enabling predictive analytics. AI streamlines marketing operations, automating repetitive tasks and allowing marketers to concentrate on strategic aspects. It personalizes customer interactions at scale, enhancing engagement and conversion rates. AI-powered tools like chatbots […]",
    "date": "Fri, 04 Jul 2025 10:07:56 +0000",
    "link": "https://martechseries.com/mts-insights/staff-writers/optimizing-ai-and-automation-in-marketing-strategies-to-prevent-budget-wastage-and-maximize-roi/",
    "source": "MarTech Series"
  },
  {
    "headline": "The Stack: Global Tech Reset",
    "summary": "This week signals a shift in the trajectory of AI and digital media. In today’s MadTech Daily we discuss ChatGPT referrals failing to match drops from Search, Google’s new Search proposal to avoid an EU antitrust fine, and the IPA [...]\nThe post The Stack: Global Tech Reset appeared first on ExchangeWire.com.",
    "date": "Fri, 04 Jul 2025 08:00:00 +0000",
    "link": "https://www.exchangewire.com/blog/2025/07/04/the-stack-global-tech-reset/",
    "source": "ExchangeWire.com"
  },
  {
    "headline": "Optimove on Pace to More than Double New iGaming Clients in 2025, Fueled by Optimove Ignite+ and Gamification Innovation",
    "summary": "Momentum continues with enterprise renewals, rapid growth in APAC and LATAM, and accelerated adoption of Adact gamification solution Optimove, the creator of Positionless Marketing and the #1 Player Engagement Platform in iGaming, announced record-setting growth, projecting more than double new iGaming clients added in 2025 alone. The surge comes on the heels of the launch […]",
    "date": "Fri, 04 Jul 2025 06:24:21 +0000",
    "link": "https://martechseries.com/predictive-ai/ai-platforms-machine-learning/optimove-on-pace-to-more-than-double-new-igaming-clients-in-2025-fueled-by-optimove-ignite-and-gamification-innovation/",
    "source": "MarTech Series"
  },
  {
    "headline": "Bublup Launches a Pocket Import Feature to Help Users Preserve and Enhance Their Saved Content",
    "summary": "Pocket’s Upcoming Shutdown Sparks Demand for Seamless Data Migration to Bublup’s Visual Organization Platform Bublup, an integrated content and community management platform, announced the launch of a new import tool designed for users of Pocket, the read-it-later app that will officially shut down on July 8, 2025. Pocket users will lose access to their exportable […]",
    "date": "Fri, 04 Jul 2025 06:21:06 +0000",
    "link": "https://martechseries.com/content/bublup-launches-a-pocket-import-feature-to-help-users-preserve-and-enhance-their-saved-content/",
    "source": "MarTech Series"
  },
  {
    "headline": "Bupple Launches Version 2: A Major Upgrade In Social Media Content Creation",
    "summary": "Bupple, the innovative AI-powered platform designed to simplify social media content creation, today announced the launch of Bupple Version 2. Bupple Launches Version 2: A Major Upgrade Revolutionizing Social Media Content Creation Bupple Version 2 is a game changer for businesses looking to create social media content. For small businesses, Bupple delivers professional content that […]",
    "date": "Fri, 04 Jul 2025 06:16:53 +0000",
    "link": "https://martechseries.com/content/bupple-launches-version-2-a-major-upgrade-in-social-media-content-creation/",
    "source": "MarTech Series"
  },
  {
    "headline": "Podcast companies turn to live events to capture growing advertiser spend",
    "summary": "The surge in the number of live podcast events in 2025 reflects a broader shift: advertisers are betting bigger on podcasts — not just as an audio channel but as a full-fledged creator economy play.",
    "date": "Fri, 04 Jul 2025 04:01:00 +0000",
    "link": "https://digiday.com/media/podcast-companies-turn-to-live-events-to-capture-growing-advertiser-spend/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
    "source": "Digiday"
  },
  {
    "headline": "Best Buy, Lowe’s chief marketing officers explain why they launched new influencer programs",
    "summary": "CMOs launched these new programs in response to the growing importance of influencers in recommending products.",
    "date": "Fri, 04 Jul 2025 04:01:00 +0000",
    "link": "https://digiday.com/marketing/best-buy-lowes-chief-marketing-officers-explain-why-they-launched-new-influencer-programs/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
    "source": "Digiday"
  },
  {
    "headline": "Inside BET&#8217;s Transformation From Media Company to Movement",
    "summary": "CMO Kimberly Paige on how the network is pioneering change through content, culture, and community.",
    "date": "Thu, 03 Jul 2025 15:39:36 +0000",
    "link": "https://www.adweek.com/brand-marketing/inside-bets-transformation-from-media-company-to-movement/",
    "source": "Adweek Feed"
  },
  {
    "headline": "Amazon Is Asking Some Advertisers to Double Their Spend During Prime Day",
    "summary": "Stiffening competition and economic uncertainty make the pitch a tough sell.",
    "date": "Thu, 03 Jul 2025 15:32:52 +0000",
    "link": "https://www.adweek.com/commerce/amazon-is-asking-some-advertisers-to-double-their-spend-during-prime-day/",
    "source": "Adweek Feed"
  },
  {
    "headline": "The FTC’s OMG/IPG Consent Order Is Putting Politics Ahead Of The Real Issues",
    "summary": "The FTC’s consent order for the impending OMG/IPG mega-merger prohibits the two agency holding companies from blocking ad spend to publishers on the basis of politics and ideology. The order is part of a wider effort by Republicans to dismantle what the FTC and members of Congress say is an ad industry conspiracy to demonetize […]\nThe post The FTC’s OMG/IPG Consent Order Is Putting Politics Ahead Of The Real Issues appeared first on AdExchanger.",
    "date": "Thu, 03 Jul 2025 15:25:06 +0000",
    "link": "https://www.adexchanger.com/brand-safety/the-ftcs-omg-ipg-consent-order-is-putting-politics-ahead-of-the-real-issues/",
    "source": "AdExchanger"
  },
  {
    "headline": "In CTV, retail media and emerging channels, third-party data is more important than ever",
    "summary": "Georgina Bankier, vp, global platform partnerships, Eyeota, a Dun & Bradstreet company In today’s fractured media environment, connected TV and retail media are dominating advertiser attention — and their budgets. CTV ad spending is projected to reach $33.35 billion this year, while retail media’s 19.7% growth will be more than double the growth in overall […]",
    "date": "Thu, 03 Jul 2025 14:51:32 +0000",
    "link": "https://digiday.com/sponsored/in-ctv-retail-media-and-emerging-channels-third-party-data-is-more-important-than-ever/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
    "source": "Digiday"
  },
  {
    "headline": "Assembly Launches ‘Assembly Control’ to Elevate Brand Safety, Suitability, and Campaign Performance in Programmatic Media",
    "summary": "First-of-its-kind custom solution prioritizes advertisers’ brand safety and campaign performance Assembly, a leading media company part of the Stagwell challenger network, announced today the launch of Assembly Control, a proprietary brand safety and suitability solution built to give advertisers greater control over where their ads appear while unlocking stronger media performance. The product will officially […]",
    "date": "Thu, 03 Jul 2025 14:15:19 +0000",
    "link": "https://martechseries.com/sales-marketing/programmatic-buying/assembly-launches-assembly-control-to-elevate-brand-safety-suitability-and-campaign-performance-in-programmatic-media/",
    "source": "MarTech Series"
  },
  {
    "headline": "Marketing results don’t add. They multiply and synergize.",
    "summary": "Traditional metrics can’t capture how campaigns interact. Test for multiplicative and synergistic effects and rethink paid media measurement.\nThe post Marketing results don’t add. They multiply and synergize. appeared first on MarTech.",
    "date": "Thu, 03 Jul 2025 13:53:04 +0000",
    "link": "https://martech.org/marketing-results-dont-add-they-multiply-and-synergize/",
    "source": "MarTech"
  },
  {
    "headline": "Marketing results don’t add. They multiply and synergize.",
    "summary": "Traditional metrics can’t capture how campaigns interact. Test for multiplicative and synergistic effects and rethink paid media measurement.\nThe post Marketing results don’t add. They multiply and synergize. appeared first on MarTech.",
    "date": "Thu, 03 Jul 2025 13:53:04 +0000",
    "link": "https://martech.org/marketing-results-dont-add-they-multiply-and-synergize/",
    "source": "MarTech"
  },
  {
    "headline": "Adform Accelerates Digital-Out-of-Home Growth as First Global Omnichannel DSP to Launch Visual Planning Interface",
    "summary": "Following 118% year-on-year expansion in client Digital-Out-of-Home spend in Q1 2025, Adform is unlocking the channel’s potential to drive game-changing omnichannel performance. Adform, the most powerful and safe media buying platform built for game changers, has announced the launch of its new Digital-Out-of-Home (DOOH) planner within Adform FLOW. The tool will initially roll out across […]",
    "date": "Thu, 03 Jul 2025 13:16:06 +0000",
    "link": "https://martechseries.com/sales-marketing/programmatic-buying/adform-accelerates-digital-out-of-home-growth-as-first-global-omnichannel-dsp-to-launch-visual-planning-interface/",
    "source": "MarTech Series"
  },
  {
    "headline": "Wildix Introduces Wilma AI, the Embedded Agentic AI Teammate Behind Smarter Business Communication",
    "summary": "Wildix, a global leader in Unified Communications as a Service (UCaaS), introduced Wilma AI, the embedded communication specialist powered by the company’s proprietary agentic AI framework. Now active throughout the Wildix ecosystem, Wilma turns everyday communication into intelligent, real-time execution. This announcement follows the company’s formal launch of agentic AI capabilities last month, which marked a […]",
    "date": "Thu, 03 Jul 2025 13:10:25 +0000",
    "link": "https://martechseries.com/predictive-ai/ai-platforms-machine-learning/wildix-introduces-wilma-ai-the-embedded-agentic-ai-teammate-behind-smarter-business-communication/",
    "source": "MarTech Series"
  },
  {
    "headline": "5 Amazon Ads features you’re not using — but should be",
    "summary": "Missed these Amazon Ads features? Catch up on Attribution, Prime Video and more ways to drive better, data-backed campaigns.\nThe post 5 Amazon Ads features you’re not using — but should be appeared first on MarTech.",
    "date": "Thu, 03 Jul 2025 12:24:00 +0000",
    "link": "https://martech.org/5-amazon-ads-features-youre-not-using-but-should-be/",
    "source": "MarTech"
  },
  {
    "headline": "5 Amazon Ads features you’re not using — but should be",
    "summary": "Missed these Amazon Ads features? Catch up on Attribution, Prime Video and more ways to drive better, data-backed campaigns.\nThe post 5 Amazon Ads features you’re not using — but should be appeared first on MarTech.",
    "date": "Thu, 03 Jul 2025 12:24:00 +0000",
    "link": "https://martech.org/5-amazon-ads-features-youre-not-using-but-should-be/",
    "source": "MarTech"
  },
  {
    "headline": "The latest AI-powered martech news and releases",
    "summary": "Why won't Google let me search without AI Overviews?\nThe post The latest AI-powered martech news and releases appeared first on MarTech.",
    "date": "Thu, 03 Jul 2025 12:20:00 +0000",
    "link": "https://martech.org/the-latest-ai-powered-martech-news-and-releases/",
    "source": "MarTech"
  },
  {
    "headline": "The latest AI-powered martech news and releases",
    "summary": "Why won't Google let me search without AI Overviews?\nThe post The latest AI-powered martech news and releases appeared first on MarTech.",
    "date": "Thu, 03 Jul 2025 12:20:00 +0000",
    "link": "https://martech.org/the-latest-ai-powered-martech-news-and-releases/",
    "source": "MarTech"
  },
  {
    "headline": "As AI Advances, Staff-Level Jobs at Ad Agencies Decline",
    "summary": "Staff positions at U.S. advertising and marketing companies are down more than 10% since January 2022.",
    "date": "Thu, 03 Jul 2025 11:24:19 +0000",
    "link": "https://www.adweek.com/agencies/as-ai-advances-staff-level-jobs-at-ad-agencies-decline/",
    "source": "Adweek Feed"
  },
  {
    "headline": "Opera Brings Built-in Translation to Its Desktop Browsers and Animated Cursors to Opera Gx in Latest Update",
    "summary": "Norway-based browser developer, Opera , is breaking down language barriers for its users with the launch of Opera Translate, a new, secure, and built-in translation feature for its flagship desktop browsers, Opera One and Opera GX. This significant update also brings powerful multitasking tools to both browsers and adds a new personalization option to Opera GX […]",
    "date": "Thu, 03 Jul 2025 11:02:49 +0000",
    "link": "https://martechseries.com/content/opera-brings-built-in-translation-to-its-desktop-browsers-and-animated-cursors-to-opera-gx-in-latest-update/",
    "source": "MarTech Series"
  },
  {
    "headline": "WPP Communications Chief Chris Wade Departs After 13 Years",
    "summary": "Chris Wade, WPP’s longtime head of communications and corporate affairs, is leaving the holding company after 13 years.",
    "date": "Thu, 03 Jul 2025 10:30:41 +0000",
    "link": "https://www.adweek.com/agencies/wpp-communications-chief-chris-wade-departs-after-13-years/",
    "source": "Adweek Feed"
  },
  {
    "headline": "Signal-First Marketing: Why Modern Martech Needs To Listen Before It Acts?",
    "summary": "Not that long ago, marketing was mostly about making educated predictions. Brands built advertising based on general personas, gut feelings, and past performance data. Messages were made weeks or even months ahead of time, and they were sent out on a strict, batch-based schedule. This “spray-and-pray” method may have worked in the short term, but […]",
    "date": "Thu, 03 Jul 2025 10:00:12 +0000",
    "link": "https://martechseries.com/mts-insights/staff-writers/signal-first-marketing-why-modern-martech-needs-to-listen-before-it-acts/",
    "source": "MarTech Series"
  },
  {
    "headline": "Digest: Google Fined $314M; X Suffers Sharpest UK Audience Drop Among Top 25 Publishers",
    "summary": "In today’s Digest, we cover legal developments including Google being fined $314.6m and Paramount settling the ‘60 Minutes’ lawsuit with Trump. We also look at X’s UK audience drop among the top 25 publishers and the US Senate’s rejection of [...]\nThe post Digest: Google Fined $314M; X Suffers Sharpest UK Audience Drop Among Top 25 Publishers appeared first on ExchangeWire.com.",
    "date": "Thu, 03 Jul 2025 08:00:00 +0000",
    "link": "https://www.exchangewire.com/blog/2025/07/03/daily-google-fined-314-6m-paramount-settles-60-minutes-suit-with-trump-x-suffers-sharpest-uk-audience-drop-among-top-25-publishers/",
    "source": "ExchangeWire.com"
  },
  {
    "headline": "The Future of Media Buying is Here – and It’s Not Walled in by Big Tech  ",
    "summary": "Phil Duffield, VP UK at The Trade Desk, examines media buying. He expands on how brands have turned challenges into transformation, keeping pace with the content boom, and facilitating smarter buying. \nA new approach to digital advertising innovation is here. \nFrom [...]\nThe post The Future of Media Buying is Here – and It’s Not Walled in by Big Tech   appeared first on ExchangeWire.com.",
    "date": "Thu, 03 Jul 2025 08:00:00 +0000",
    "link": "https://www.exchangewire.com/blog/2025/07/03/the-future-of-media-buying-is-here-and-its-not-walled-in-by-big-tech/",
    "source": "ExchangeWire.com"
  },
  {
    "headline": "Ticker: GMA to Celebrate 50th Anniversary by Visiting 50 States",
    "summary": "C-SPAN is kicking off its America 250 special programming this weekend.",
    "date": "Thu, 03 Jul 2025 06:00:00 +0000",
    "link": "https://www.adweek.com/tvnewser/ticker-gma-to-celebrate-50th-anniversary-by-visiting-50-states/",
    "source": "Adweek Feed"
  },
  {
    "headline": "The Risk of Saying Nothing: Why Agencies Must Lead Now",
    "summary": "People are watching, young people especially. They’re waiting for leaders to lead.",
    "date": "Thu, 03 Jul 2025 06:00:00 +0000",
    "link": "https://www.adweek.com/agencies/lead-now-ice-protests-los-angeles-risk-saying-nothing/",
    "source": "Adweek Feed"
  },
  {
    "headline": "How Megan Thee Stallion Brought Hot Girl Summer to Love Island USA",
    "summary": "According to NBCUniversal, the Megan Thee Stallion episode drove a 25% increase in scan rate for shoppable.",
    "date": "Thu, 03 Jul 2025 06:00:00 +0000",
    "link": "https://www.adweek.com/convergent-tv/how-megan-thee-stallion-brought-hot-girl-summer-to-love-island-usa/",
    "source": "Adweek Feed"
  },
  {
    "headline": "What’s The Scoop On Häagen-Dazs’ Evolving Media Mix?",
    "summary": "Practically everyone on Earth likes ice cream. (If you don’t, feel free to close this tab and reevaluate your tastes.) But for advertisers, reaching “practically everyone” is a challenge. It’s the classic “my customer is anyone with a mouth” conundrum. According to Rachel Jaiven, head of marketing at Häagen-Dazs, its audience is anyone who loves […]\nThe post What’s The Scoop On Häagen-Dazs’ Evolving Media Mix? appeared first on AdExchanger.",
    "date": "Thu, 03 Jul 2025 05:00:20 +0000",
    "link": "https://www.adexchanger.com/marketers/whats-the-scoop-on-haagen-dazs-evolving-media-mix/",
    "source": "AdExchanger"
  },
  {
    "headline": "Amazon’s Damned-If-You-Don’t Pitch; Why Regular Isn’t Easy",
    "summary": "Hey everyone! The AdExchanger team has gone grillin’ for July 4. The Daily News Roundup will return July 7. Enjoy the holiday! Green Light Amazon has used the presence of shady or unauthorized sellers on its platform as leverage to bring big brands to the negotiating table.  This newsletter recently chronicled Nike’s begrudging return to […]\nThe post Amazon’s Damned-If-You-Don’t Pitch; Why Regular Isn’t Easy appeared first on AdExchanger.",
    "date": "Thu, 03 Jul 2025 04:03:10 +0000",
    "link": "https://www.adexchanger.com/daily-news-roundup/amazons-damned-if-you-dont-pitch-why-regular-isnt-easy/",
    "source": "AdExchanger"
  },
  {
    "headline": "Agencies create specialist units to help marketers’ solve for AI search gatekeepers",
    "summary": "Wpromote, Kepler and Jellyfish practices aim to illuminate impact of black box LLMs' understanding of brands search and social efforts.",
    "date": "Thu, 03 Jul 2025 04:01:00 +0000",
    "link": "https://digiday.com/marketing/agencies-create-specialist-units-to-help-marketers-solve-for-ai-search-gatekeepers/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
    "source": "Digiday"
  },
  {
    "headline": "What AI startup Cluely gets — and ad tech forgets — about attention",
    "summary": "Cluely launched a narrative before it launched a tool. And somehow, it’s working.",
    "date": "Thu, 03 Jul 2025 04:01:00 +0000",
    "link": "https://digiday.com/marketing/what-ai-startup-cluely-gets-and-ad-tech-forgets-about-attention/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
    "source": "Digiday"
  },
  {
    "headline": "Media Briefing: ‘Cloudflare is locking the door’: Publishers celebrate victory against AI bot crawlers ",
    "summary": "After years of miserably watching their content get ransacked for free by millions of unidentified AI bot crawlers, publishers were finally thrown a viable lifeline.",
    "date": "Thu, 03 Jul 2025 04:01:00 +0000",
    "link": "https://digiday.com/media/media-briefing-cloudflare-is-locking-the-door-publishers-celebrate-victory-against-ai-bot-crawlers/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
    "source": "Digiday"
  },
  {
    "headline": "How Vogue could navigate potential industry headwinds as Anna Wintour — who agency execs say made ad dollars flow — brings on new edit lead",
    "summary": "Anna Wintour's successor at Vogue will have to overcome the myriad of challenges facing fashion media and the digital publishing ecosystem.",
    "date": "Thu, 03 Jul 2025 04:01:00 +0000",
    "link": "https://digiday.com/media/vogue-faces-new-headwinds-as-anna-wintour-who-agency-execs-say-made-ad-dollars-flow-shifts-focus/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
    "source": "Digiday"
  },
  {
    "headline": "Two Chicago Anchors Make Cameos in New Marvel Series",
    "summary": "The Walt Disney Company is the parent company of the Chicago ABC owned station, which likely made the cameos possible.",
    "date": "Wed, 02 Jul 2025 19:52:58 +0000",
    "link": "https://www.adweek.com/tvspy/two-chicago-anchors-make-cameos-in-new-marvel-series/",
    "source": "Adweek Feed"
  },
  {
    "headline": "Week of June 23 Cable News Ratings: All Networks Record Declines",
    "summary": "Fox News remained No. 1 across the board.",
    "date": "Wed, 02 Jul 2025 18:07:47 +0000",
    "link": "https://www.adweek.com/tvnewser/week-of-june-23-2025-cable-news-ratings/",
    "source": "Adweek Feed"
  },
  {
    "headline": "Amazon Is Doubling Commissions for Influencers During Prime Day",
    "summary": "Ahead of Amazon Prime Day, the retailer is raising commission for creators in its influencer program across thirteen types of products.",
    "date": "Wed, 02 Jul 2025 16:26:19 +0000",
    "link": "https://www.adweek.com/commerce/amazon-is-doubling-commissions-for-influencers-during-prime-day/",
    "source": "Adweek Feed"
  },
  {
    "headline": "Google Ads rolls out AI Max search match type",
    "summary": "Google Ads’ new AI Max match type gives visibility into automated search performance for clearer comparisons and more informed campaign decisions.\nThe post Google Ads rolls out AI Max search match type appeared first on MarTech.",
    "date": "Wed, 02 Jul 2025 15:59:12 +0000",
    "link": "https://martech.org/google-ads-rolls-out-ai-max-search-match-type/",
    "source": "MarTech"
  },
  {
    "headline": "Google Ads rolls out AI Max search match type",
    "summary": "Google Ads’ new AI Max match type gives visibility into automated search performance for clearer comparisons and more informed campaign decisions.\nThe post Google Ads rolls out AI Max search match type appeared first on MarTech.",
    "date": "Wed, 02 Jul 2025 15:59:12 +0000",
    "link": "https://martech.org/google-ads-rolls-out-ai-max-search-match-type/",
    "source": "MarTech"
  },
  {
    "headline": "Using AI to build a DIY customer sentiment analysis solution",
    "summary": "Struggling to decode survey free-text responses? You’re not alone. Discover how AI tools like Gemini turn chaos into clarity — without extra cost.\nThe post Using AI to build a DIY customer sentiment analysis solution appeared first on MarTech.",
    "date": "Wed, 02 Jul 2025 13:46:52 +0000",
    "link": "https://martech.org/using-ai-to-build-a-diy-customer-sentiment-analysis-solution/",
    "source": "MarTech"
  },
  {
    "headline": "Using AI to build a DIY customer sentiment analysis solution",
    "summary": "Struggling to decode survey free-text responses? You’re not alone. Discover how AI tools like Gemini turn chaos into clarity — without extra cost.\nThe post Using AI to build a DIY customer sentiment analysis solution appeared first on MarTech.",
    "date": "Wed, 02 Jul 2025 13:46:52 +0000",
    "link": "https://martech.org/using-ai-to-build-a-diy-customer-sentiment-analysis-solution/",
    "source": "MarTech"
  },
  {
    "headline": "Sounder Is Using AI To Decode The Contextual Nuances Of Spanish-Language Media",
    "summary": "When you hear the word “crystal,” what’s the first thing that comes to mind? For some, it might be healing and chakras. Others might think of the champagne brand or the Chilean pilsner Cerveza Cristal, a popular beer in many Spanish-speaking countries. Semantic analysis is challenging enough for AI when dealing with online display, let […]\nThe post Sounder Is Using AI To Decode The Contextual Nuances Of Spanish-Language Media appeared first on AdExchanger.",
    "date": "Wed, 02 Jul 2025 13:00:28 +0000",
    "link": "https://www.adexchanger.com/publishers/sounder-is-using-ai-to-decode-the-contextual-nuances-of-spanish-language-media/",
    "source": "AdExchanger"
  },
  {
    "headline": "Pentaleap and Skai Announce Partnership to Democratise and Advance an Open Retail Media Ecosystem",
    "summary": "Pentaleap Inc., a leading retail media technology provider, and Skai, the leading omnichannel advertising platform for commerce media, today (2 July, 2025) announced a strategic partnership to connect advertiser demand with supply from leading retail media networks around the world.\nThis collaboration brings together Pentaleap’s innovative [...]\nThe post Pentaleap and Skai Announce Partnership to Democratise and Advance an Open Retail Media Ecosystem appeared first on ExchangeWire.com.",
    "date": "Wed, 02 Jul 2025 13:00:00 +0000",
    "link": "https://www.exchangewire.com/blog/2025/07/02/pentaleap-and-skai-announce-partnership-to-democratise-and-advance-an-open-retail-media-ecosystem/",
    "source": "ExchangeWire.com"
  },
  {
    "headline": "An outcome-driven framework for core martech selection",
    "summary": "Make smarter martech choices with a four-point framework that connects marketing needs to business outcomes and technical realities.\t\nThe post An outcome-driven framework for core martech selection appeared first on MarTech.",
    "date": "Wed, 02 Jul 2025 12:39:00 +0000",
    "link": "https://martech.org/an-outcome-driven-framework-for-core-martech-selection/",
    "source": "MarTech"
  },
  {
    "headline": "An outcome-driven framework for core martech selection",
    "summary": "Make smarter martech choices with a four-point framework that connects marketing needs to business outcomes and technical realities.\t\nThe post An outcome-driven framework for core martech selection appeared first on MarTech.",
    "date": "Wed, 02 Jul 2025 12:39:00 +0000",
    "link": "https://martech.org/an-outcome-driven-framework-for-core-martech-selection/",
    "source": "MarTech"
  },
  {
    "headline": "Seedtag Outperforms Market with 38% YoY Growth in UK, Accelerating European Momentum and Strategic Investments Across the Region",
    "summary": "Seedtag, the global neuro-contextual advertising company, has announced a quarter of significant growth across Europe, with 38% YoY Q2 growth in the UK and double-digit growth across the European region. This follows the appointments of notable recent senior hires across [...]\nThe post Seedtag Outperforms Market with 38% YoY Growth in UK, Accelerating European Momentum and Strategic Investments Across the Region appeared first on ExchangeWire.com.",
    "date": "Wed, 02 Jul 2025 12:19:25 +0000",
    "link": "https://www.exchangewire.com/blog/2025/07/02/seedtag-outperforms-market-with-38-yoy-growth-in-uk-accelerating-european-momentum-and-strategic-investments-across-the-region/",
    "source": "ExchangeWire.com"
  },
  {
    "headline": "Experian Maps UK’s Changing Living Patterns  ",
    "summary": "New data reveals the UK is undergoing an ever-evolving transformation in how and where people choose to live, driven by rising living costs, flexible working, and the desire for more space. \nAnalysis from Experian has identified the key and emerging trends [...]\nThe post Experian Maps UK’s Changing Living Patterns   appeared first on ExchangeWire.com.",
    "date": "Wed, 02 Jul 2025 12:13:06 +0000",
    "link": "https://www.exchangewire.com/blog/2025/07/02/experian-maps-uks-changing-living-patterns/",
    "source": "ExchangeWire.com"
  },
  {
    "headline": "Blame Insurance: Why Big Names Keep Winning in Ad Tech",
    "summary": "In her latest musings for ExchangeWire, Shirley Marschall dives into the pitfalls of playing it safe and choosing the incumbent behemoths, over smaller yet better alternatives.\nThere’s a pattern in ad tech. No, not a technical one. Nope, this is not [...]\nThe post Blame Insurance: Why Big Names Keep Winning in Ad Tech appeared first on ExchangeWire.com.",
    "date": "Wed, 02 Jul 2025 09:00:00 +0000",
    "link": "https://www.exchangewire.com/blog/2025/07/02/blame-insurance-why-big-names-keep-winning-in-ad-tech/",
    "source": "ExchangeWire.com"
  },
  {
    "headline": "Digest: Microsoft Faces Class Action Over Ad Data; Netflix–NASA Deal Boosts Live Streaming Lineup; Apple Considers Anthropic or OpenAI to Power Siri",
    "summary": "In today’s Digest, we discuss a class action against Microsoft Ireland Operations, Netflix–NASA’s deal to boost live streaming lineup, Apple’s consideration of Anthropic or OpenAI to power Siri, and John Lewis rolling out an offsite ad offering.\nMicrosoft Faces Irish Class [...]\nThe post Digest: Microsoft Faces Class Action Over Ad Data; Netflix–NASA Deal Boosts Live Streaming Lineup; Apple Considers Anthropic or OpenAI to Power Siri appeared first on ExchangeWire.com.",
    "date": "Wed, 02 Jul 2025 08:00:00 +0000",
    "link": "https://www.exchangewire.com/blog/2025/07/02/digest-microsoft-faces-class-action-over-ad-data-netflix-nasa-deal-boosts-live-streaming-lineup-apple-considers-anthropic-or-openai/",
    "source": "ExchangeWire.com"
  },
  {
    "headline": "When Did Ad Tech Get So Obsessed With Outcomes, Anyway?",
    "summary": "Talking about outcomes is practically a mandate, especially in the CTV space, where ad buyers and vendors alike are heavily invested in streaming television’s potential as a lower-funnel, performance-driving channel.\nThe post When Did Ad Tech Get So Obsessed With Outcomes, Anyway? appeared first on AdExchanger.",
    "date": "Wed, 02 Jul 2025 05:00:56 +0000",
    "link": "https://www.adexchanger.com/adexplainer/when-did-ad-tech-get-so-obsessed-with-outcomes-anyway/",
    "source": "AdExchanger"
  },
  {
    "headline": "The Hold On Holdcos; Temu’s Baaaaack",
    "summary": "Have agency holdcos put too many eggs in the AI basket?; Temu has come back to us now at the turn of the tariff tide; and Cloudflare wants to help sites from getting scraped. \nThe post The Hold On Holdcos; Temu’s Baaaaack appeared first on AdExchanger.",
    "date": "Wed, 02 Jul 2025 04:03:13 +0000",
    "link": "https://www.adexchanger.com/daily-news-roundup/wednesday-20250207/",
    "source": "AdExchanger"
  },
  {
    "headline": "Here are the biggest misconceptions about AI content scraping",
    "summary": "An increase in bots scraping content from publishers’ sites represents a huge threat to their businesses. But scraping for AI training and scraping for real-time outputs present different challenges and opportunities.",
    "date": "Wed, 02 Jul 2025 04:01:00 +0000",
    "link": "https://digiday.com/media/here-are-the-biggest-misconceptions-about-ai-content-scraping/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
    "source": "Digiday"
  },
  {
    "headline": "How Future is using its own AI engine to turn deeper engagement into ad dollars ",
    "summary": "Future is betting on AI to boost recirculation – and make that stickier audience more appealing to advertisers.",
    "date": "Wed, 02 Jul 2025 04:01:00 +0000",
    "link": "https://digiday.com/media/how-future-is-using-its-own-ai-engine-to-turn-deeper-engagement-into-ad-dollars/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
    "source": "Digiday"
  },
  {
    "headline": "Future of TV Briefing: TV is YouTube’s top screen — except when counting views and among Gen Z viewers",
    "summary": "This week’s Future of TV Briefing looks at how mobile still accounts for an overwhelming majority of YouTube video views and why some Gen Z viewers aren’t tuning into YouTube on TV screens.",
    "date": "Wed, 02 Jul 2025 04:01:00 +0000",
    "link": "https://digiday.com/future-of-tv/future-of-tv-briefing-tv-is-youtubes-top-screen-except-when-counting-views-and-among-gen-z-viewers/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
    "source": "Digiday"
  },
  {
    "headline": "Substack’s video bet could be a growth hack for small creators",
    "summary": "Video is helping smaller creators on Substack grow their subscriber numbers faster — but larger creators aren't experiencing the same boost.",
    "date": "Wed, 02 Jul 2025 04:01:00 +0000",
    "link": "https://digiday.com/media/substacks-video-bet-could-be-a-growth-hack-for-small-creators/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
    "source": "Digiday"
  },
  {
    "headline": "Meta’s Business Messaging Product Lead Says Bringing Ads To WhatsApp Is ‘An Evolution,’ Not A Broken Promise",
    "summary": "When WhatsApp began serving ads in mid-June, there were two main reactions. One, didn’t the founders always insist there would never be ads on WhatsApp? And two, what the heck took Meta so long? It was only inevitable that Meta would roll out ads in an app that now has more than 3 billion monthly […]\nThe post Meta’s Business Messaging Product Lead Says Bringing Ads To WhatsApp Is ‘An Evolution,’ Not A Broken Promise appeared first on AdExchanger.",
    "date": "Tue, 01 Jul 2025 18:12:55 +0000",
    "link": "https://www.adexchanger.com/platforms/metas-business-messaging-product-lead-says-bringing-ads-to-whatsapp-is-an-evolution-not-a-broken-promise/",
    "source": "AdExchanger"
  },
  {
    "headline": "6 marketing team silos you need to break down, and how to do it",
    "summary": "Tired of siloed teams and misaligned campaigns? Discover six hidden blockers to marketing performance — and how to break them down, step by step.\nThe post 6 marketing team silos you need to break down, and how to do it appeared first on MarTech.",
    "date": "Tue, 01 Jul 2025 17:02:28 +0000",
    "link": "https://martech.org/6-marketing-team-silos-you-need-to-break-down-and-how-to-do-it/",
    "source": "MarTech"
  },
  {
    "headline": "6 marketing team silos you need to break down, and how to do it",
    "summary": "Tired of siloed teams and misaligned campaigns? Discover six hidden blockers to marketing performance — and how to break them down, step by step.\nThe post 6 marketing team silos you need to break down, and how to do it appeared first on MarTech.",
    "date": "Tue, 01 Jul 2025 17:02:28 +0000",
    "link": "https://martech.org/6-marketing-team-silos-you-need-to-break-down-and-how-to-do-it/",
    "source": "MarTech"
  },
  {
    "headline": "How Advertisers Are Unlocking Full-Funnel Growth with Amazon Ads & Agentic AI | Michelle Urwin, Skai",
    "summary": "Michelle Urwin, Chief Marketing Officer of Skai, joined Sarah Sluis at Cannes Lions 2025 to share the biggest shifts in commerce media . From Amazon’s expanding DSP and full-funnel capabilities to the rise of Agentic AI in campaign optimization, this conversation dives into how retail media is evolving fast, and how advertisers can keep up. […]\nThe post How Advertisers Are Unlocking Full-Funnel Growth with Amazon Ads & Agentic AI | Michelle Urwin, Skai appeared first on AdExchanger.",
    "date": "Tue, 01 Jul 2025 16:21:07 +0000",
    "link": "https://www.adexchanger.com/content-studio/how-advertisers-are-unlocking-full-funnel-growth-with-amazon-ads-agentic-ai-michelle-urwin-skai/",
    "source": "AdExchanger"
  },
  {
    "headline": "Cloudflare rolls out a way for sites to charge AI crawlers for access",
    "summary": "The company will also block AI bots by default on new user accounts.\nThe post Cloudflare rolls out a way for sites to charge AI crawlers for access appeared first on MarTech.",
    "date": "Tue, 01 Jul 2025 16:03:55 +0000",
    "link": "https://martech.org/cloudflare-rolls-out-a-way-for-sites-to-charge-ai-crawlers-for-access/",
    "source": "MarTech"
  },
  {
    "headline": "Cloudflare rolls out a way for sites to charge AI crawlers for access",
    "summary": "The company will also block AI bots by default on new user accounts.\nThe post Cloudflare rolls out a way for sites to charge AI crawlers for access appeared first on MarTech.",
    "date": "Tue, 01 Jul 2025 16:03:55 +0000",
    "link": "https://martech.org/cloudflare-rolls-out-a-way-for-sites-to-charge-ai-crawlers-for-access/",
    "source": "MarTech"
  },
  {
    "headline": "Interactive emails give your sales funnel a competitive edge",
    "summary": "Level up your email marketing strategy with gamification, polls, embedded videos and other high-impact interactive tools.\nThe post Interactive emails give your sales funnel a competitive edge appeared first on MarTech.",
    "date": "Tue, 01 Jul 2025 12:38:00 +0000",
    "link": "https://martech.org/interactive-emails-give-your-sales-funnel-a-competitive-edge/",
    "source": "MarTech"
  },
  {
    "headline": "Interactive emails give your sales funnel a competitive edge",
    "summary": "Level up your email marketing strategy with gamification, polls, embedded videos and other high-impact interactive tools.\nThe post Interactive emails give your sales funnel a competitive edge appeared first on MarTech.",
    "date": "Tue, 01 Jul 2025 12:38:00 +0000",
    "link": "https://martech.org/interactive-emails-give-your-sales-funnel-a-competitive-edge/",
    "source": "MarTech"
  },
  {
    "headline": "DoubleVerify Debuts First-of-Its-Kind Attention Measurement for Social, Launching with Snap",
    "summary": "DoubleVerify, the leading software platform to verify media quality, optimise ad performance, and prove campaign outcomes, today (30th June, 2025) announced the launch of DV Authentic Attention® for Social. The product will first launch with Snap, combining timely platform signals with [...]\nThe post DoubleVerify Debuts First-of-Its-Kind Attention Measurement for Social, Launching with Snap appeared first on ExchangeWire.com.",
    "date": "Tue, 01 Jul 2025 11:22:13 +0000",
    "link": "https://www.exchangewire.com/blog/2025/07/01/doubleverify-debuts-first-of-its-kind-attention-measurement-for-social-launching-with-snap/",
    "source": "ExchangeWire.com"
  },
  {
    "headline": "Introducing The Wedding Tech Stack",
    "summary": "Today, David’s Bridal is as much an AI-powered tech company as it is a retailer of wedding apparel and accessories. “The wedding process is, of course, more than just the dress,” says Elina Vilk, president and chief business officer of David’s Bridal, on this week’s episode of AdExchanger Talks. Around 90% of brides in the […]\nThe post Introducing The Wedding Tech Stack appeared first on AdExchanger.",
    "date": "Tue, 01 Jul 2025 10:00:53 +0000",
    "link": "https://www.adexchanger.com/adexchanger-talks/introducing-the-wedding-tech-stack/",
    "source": "AdExchanger"
  },
  {
    "headline": "Digest: Google’s Emissions Surge 51%; Canada Drops Tech Tax Amid Trump Trade Talks",
    "summary": "In today’s Digest, we discuss Google’s soaring carbon emissions, Canada dropping a tech tax amid Trump trade talks, and Facebook requesting Meta AI access to unshared camera roll photos.\nGoogle’s Emissions Surge 51% as AI Power Use Grows\nGoogle’s carbon footprint has surged [...]\nThe post Digest: Google’s Emissions Surge 51%; Canada Drops Tech Tax Amid Trump Trade Talks appeared first on ExchangeWire.com.",
    "date": "Tue, 01 Jul 2025 08:00:00 +0000",
    "link": "https://www.exchangewire.com/blog/2025/07/01/digest-googles-emissions-surge-51-canada-drops-tech-tax-amid-trump-trade-talks-facebook-requests-meta-ai-access-to-unshared-camera-roll-photos/",
    "source": "ExchangeWire.com"
  },
  {
    "headline": "All You Can Eat Video Buffet; No Cannes Do",
    "summary": "Where would the New York Times be without its recipes?; Cannes Lions deals with controversy; and Netflix wants to get ultra-personal with its ads.\nThe post All You Can Eat Video Buffet; No Cannes Do appeared first on AdExchanger.",
    "date": "Tue, 01 Jul 2025 04:03:44 +0000",
    "link": "https://www.adexchanger.com/daily-news-roundup/tuesday-20250107/",
    "source": "AdExchanger"
  },
  {
    "headline": "Ad Tech Briefing: Start-ups are now table stakes for the future of ad tech",
    "summary": "Scaled ad tech companies need to maintain relationships with startups, when the sector is experiencing ongoing disruption due to AI.",
    "date": "Tue, 01 Jul 2025 04:01:00 +0000",
    "link": "https://digiday.com/marketing/ad-tech-briefing-start-ups-are-now-table-stakes-for-the-future-of-ad-tech/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
    "source": "Digiday"
  },
  {
    "headline": "Inside Kristi Argyilan’s RMN playbook: Lessons from the ‘godmother’ of retail media",
    "summary": "Uber’s global head of advertising Kristi Argyilan says the future of retail media hinges on real-time relevance, brand differentiation, and breaking free from a one-size-fits-all playbook.",
    "date": "Tue, 01 Jul 2025 04:01:00 +0000",
    "link": "https://digiday.com/marketing/inside-kristi-argyilans-rmn-playbook-lessons-from-the-godmother-of-retail-media/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
    "source": "Digiday"
  },
  {
    "headline": "Digiday+ Research: More than half of marketers invest in TV and streaming, with an eye on impressions and branding",
    "summary": "The majority of marketers are directing ad spend toward TV, with a focus on ads that drive impressions and branding.",
    "date": "Tue, 01 Jul 2025 04:01:00 +0000",
    "link": "https://digiday.com/marketing/digiday-research-more-than-half-of-marketers-invest-in-tv-and-streaming-with-an-eye-on-impressions-and-branding/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
    "source": "Digiday"
  },
  {
    "headline": "In the age of AI Overviews, Tripadvisor wants to be the destination",
    "summary": "AI is changing search — Tripadvisor wants to change with it.",
    "date": "Tue, 01 Jul 2025 04:01:00 +0000",
    "link": "https://digiday.com/marketing/in-the-age-of-ai-overviews-tripadvisor-wants-to-be-the-destination/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
    "source": "Digiday"
  },
  {
    "headline": "Microsoft Ads gets new granular asset-level reviews",
    "summary": "Microsoft Advertising now reviews ads at the asset level, allowing approved elements to continue running even if others are disapproved.\nThe post Microsoft Ads gets new granular asset-level reviews appeared first on MarTech.",
    "date": "Mon, 30 Jun 2025 13:30:31 +0000",
    "link": "https://martech.org/microsoft-ads-gets-new-granular-asset-level-reviews/",
    "source": "MarTech"
  },
  {
    "headline": "Microsoft Ads gets new granular asset-level reviews",
    "summary": "Microsoft Advertising now reviews ads at the asset level, allowing approved elements to continue running even if others are disapproved.\nThe post Microsoft Ads gets new granular asset-level reviews appeared first on MarTech.",
    "date": "Mon, 30 Jun 2025 13:30:31 +0000",
    "link": "https://martech.org/microsoft-ads-gets-new-granular-asset-level-reviews/",
    "source": "MarTech"
  },
  {
    "headline": "From noise to revenue: What intent data is really telling you",
    "summary": "This article was originally published in 2017 and was last updated on June 28, 2025. Tension: Marketers want…\nThe post From noise to revenue: What intent data is really telling you appeared first on DMNews.",
    "date": "Sat, 28 Jun 2025 04:20:00 +0000",
    "link": "https://dmnews.com/the-monday-stack-technology-is-the-content-being-marketed/",
    "source": "DMNews"
  },
  {
    "headline": "The importance of Instagram aesthetics",
    "summary": "This article was originally published in 2024 and was last updated on June 28, 2025. Tension: Brands want…\nThe post The importance of Instagram aesthetics appeared first on DMNews.",
    "date": "Sat, 28 Jun 2025 04:15:00 +0000",
    "link": "https://dmnews.com/the-importance-of-instagram-aesthetics/",
    "source": "DMNews"
  },
  {
    "headline": "The art (and science) behind Jaguar’s marketing performance",
    "summary": "This article was originally published in 2015 and was last updated on June 28, 2025. Tension: Jaguar markets…\nThe post The art (and science) behind Jaguar’s marketing performance appeared first on DMNews.",
    "date": "Sat, 28 Jun 2025 03:00:00 +0000",
    "link": "https://dmnews.com/the-art-and-science-behind-jaguars-marketing-performance/",
    "source": "DMNews"
  },
  {
    "headline": "The hidden cost of brand mergers: Lessons from Talbots and J.Jill",
    "summary": "This article was originally published in 2006 and was last updated on June 28, 2025. Tension: Fashion brands…\nThe post The hidden cost of brand mergers: Lessons from Talbots and J.Jill appeared first on DMNews.",
    "date": "Sat, 28 Jun 2025 02:43:16 +0000",
    "link": "https://dmnews.com/talbots-buys-j-jill-for-517-million/",
    "source": "DMNews"
  },
  {
    "headline": "Strengthening cybersecurity vital for business success",
    "summary": "This article was originally published in 2023 and was last updated on June 28, 2025. Tension: We expect…\nThe post Strengthening cybersecurity vital for business success appeared first on DMNews.",
    "date": "Sat, 28 Jun 2025 02:18:16 +0000",
    "link": "https://dmnews.com/strengthening-cybersecurity-vital-for-business-success/",
    "source": "DMNews"
  },
  {
    "headline": "4 small business martech tools you need to invest in ASAP",
    "summary": "This article was originally published in 2024 and was last updated on June 28, 2025. Tension: Small business…\nThe post 4 small business martech tools you need to invest in ASAP appeared first on DMNews.",
    "date": "Sat, 28 Jun 2025 02:02:30 +0000",
    "link": "https://dmnews.com/small-business-tools/",
    "source": "DMNews"
  },
  {
    "headline": "When a data breach exposes more than data: The real lesson from Schneider Electric",
    "summary": "This article was originally published in 2024 and was last updated on June 28, 2025. Tension: Cyberattacks aren’t…\nThe post When a data breach exposes more than data: The real lesson from Schneider Electric appeared first on DMNews.",
    "date": "Sat, 28 Jun 2025 01:45:00 +0000",
    "link": "https://dmnews.com/schneider-electric-confirms-massive-data-breach/",
    "source": "DMNews"
  },
  {
    "headline": "When marketing meets dignity: Lessons from a quietly brilliant email campaign",
    "summary": "This article was originally published in 2001 and was last updated on June 28, 2025. Tension: Older adults…\nThe post When marketing meets dignity: Lessons from a quietly brilliant email campaign appeared first on DMNews.",
    "date": "Sat, 28 Jun 2025 01:31:27 +0000",
    "link": "https://dmnews.com/response-to-hearing-aid-company39s-email-campaign-is-loud-and-clear/",
    "source": "DMNews"
  },
  {
    "headline": "Retail industry poised for AI transformation in 2025",
    "summary": "This article was originally published in 2024 and was last updated June 28, 2025. Tension: Retail leaders know…\nThe post Retail industry poised for AI transformation in 2025 appeared first on DMNews.",
    "date": "Fri, 27 Jun 2025 18:00:00 +0000",
    "link": "https://dmnews.com/retail-industry-poised-for-ai-transformation-in-2025/",
    "source": "DMNews"
  },
  {
    "headline": "Retail customer experiences are changing",
    "summary": "This article was originally published in 2022 and was last updated June 28, 2025. Tension: Shoppers say they…\nThe post Retail customer experiences are changing appeared first on DMNews.",
    "date": "Fri, 27 Jun 2025 17:26:36 +0000",
    "link": "https://dmnews.com/retail-customer-experiences/",
    "source": "DMNews"
  }
]